data_action = [
    {
        title: "โจมตี",
        icon: "crossed-swords",
        subtitle: "โจมตีระยะประชิดหรือระยะไกล",
        description: "โจมตีระยะประชิดหรือระยะไกลด้วยอาวุธของคุณ",
        reference: "PHB, หน้า 192, 194-195.",
        bullets: [
            "คุณสมบัติบางอย่าง เช่น คุณสมบัติ<i>การโจมตีเพิ่มเติม</i>ของนักสู้ จะสามารถทำให้คุณโจมตีมากกว่าหนึ่งครั้งในการใช้การกระทำนี้ การโจมตีแต่ละครั้งนี้ถือว่าเป็นการทอยแยกและอาจโจมตีเป้าหมายที่แตกต่างกันได้ คุณสามารถเคลื่อนที่ระหว่างการโจมตีเหล่านี้ได้",
            "เมื่อคุณโจมตีด้วยอาวุธเบาระยะประชิด คุณสามารถใช้การกระทำโบนัสพิเศษเพื่อโจมตีด้วยมืออีกข้าง (ดูที่การกระทำโบนัส <i>โจมตีมือรอง</i>)",
            "คุณสามารถ <i>จับ</i> หรือ <i>ดัน</i> แทนการโจมตีระยะประชิดได้หนึ่ง",
            "เงื่อนไขบางประการจะทำให้ได้เปรียบในการโจมตี: การโจมตีเป้าหมายที่ถูกทำให้ตาบอด, อัมพาต, กลายเป็นหิน, ถูกตรึง, มึนงง, หรือหมดสติ; การโจมตีระยะประชิดต่อเป้าหมายที่ล้มลง; การโจมตีโดยผู้โจมตีที่ล่องหนหรือซ่อนอยู่",
            "เงื่อนไขบางประการจะทำให้เสียเปรียบในการโจมตี: การโจมตีเป้าหมายที่ล่องหนหรือซ่อนตัว; การโจมตีระยะไกลต่อเป้าหมายที่ล้มลง; การโจมตีโดยผู้โจมตีนั้นตาบอด, หวาดกลัว, ถูกวางยาพิษ, หรือถูกควบคุม"
        ]
    },
    {
        title: "จับ",
        icon: "grab",
        subtitle: "การโจมตีพิเศษระยะประชิด",
        description: "พยายามจับหรือปล้ำกับสิ่งมีชีวิต",
        reference: "PHB, หน้า 195.",
        bullets: [
            "คุณสามารถใช้การกระทำ <i>โจมตี</i> เพื่อทำการโจมตีพิเศษระยะประชิด คือ การจับ หากคุณสามารถทำการโจมตีหลายครั้งด้วยการกระทำโจมตี การโจมตีนี้จะแทนที่หนึ่งในนั้น",
            "เป้าหมายของการจับของคุณต้องมีขนาดไม่เกินกว่าคุณหนึ่งขนาด และต้องอยู่ในระยะที่คุณเอื้อมถึง",
            "โดยใช้มือที่ว่างอย่างน้อยหนึ่งมือ คุณพยายามจับเป้าหมายโดยทำการทดสอบการจับ คือ การทดสอบความแข็งแกร่ง (กรีฑา) ซึ่งแข่งขันกับการทดสอบความแข็งแกร่ง (กรีฑา) หรือความคล่องแคล่ว (กายกรรม) ของเป้าหมาย (เป้าหมายเลือกความสามารถที่จะใช้)",
            "หากคุณสำเร็จ คุณจะทำให้เป้าหมายอยู่ในสถานะถูกจับ (ความเร็วของมันจะกลายเป็น 0)"
        ]
    },
    {
        title: "ผลัก",
        icon: "hand",
        subtitle: "การโจมตีพิเศษระยะประชิด",
        description: "ผลักสิ่งมีชีวิต เพื่อทำให้ล้มลงหรือลดระยะห่างจากคุณ",
        reference: "PHB, หน้า 195.",
        bullets: [
            "โดยการใช้การกระทำ <i>โจมตี</i> คุณสามารถทำการโจมตีพิเศษระยะประชิดเพื่อผลักสิ่งมีชีวิต หากคุณสามารถทำการโจมตีหลายครั้งด้วยการกระทำโจมตี การโจมตีนี้จะแทนที่หนึ่งในนั้น",
            "เป้าหมายของการผลักของคุณต้องมีขนาดไม่เกินกว่าคุณหนึ่งขนาด และต้องอยู่ในระยะที่คุณเอื้อมถึง",
            "คุณทำการทดสอบความแข็งแกร่ง (กรีฑา) แข่งขันกับการทดสอบความแข็งแกร่ง (กรีฑา) หรือความคล่องแคล่ว (กายกรรม) ของเป้าหมาย (เป้าหมายเลือกความสามารถที่จะใช้)",
            "หากคุณชนะการทดสอบ คุณจะทำให้เป้าหมายล้มลงหรือลดระยะห่างจากคุณ 5 ฟุต"
        ]
    },
    {
        title: "ร่ายเวท",
        icon: "magic-swirl",
        subtitle: "เวลาร่าย 1 การกระทำ",
        description: "ร่ายเวทที่มีเวลาร่าย 1 การกระทำ",
        reference: "PHB, หน้า 192.",
        bullets: [
            "คุณไม่สามารถร่ายเวทด้วยการกระทำของคุณและเวทอื่นที่แตกต่างด้วยการกระทำโบนัสของคุณในเทิร์นเดียวกัน ยกเว้นว่าการกระทำถูกใช้เพื่อร่ายคาถาแคนทริป",
            "เป้าหมายของเวทต้องอยู่ในระยะของเวทนั้น ในการเลือกเป้าหมาย คุณต้องมีเส้นทางที่ชัดเจนไปยังเป้าหมาย ดังนั้นเป้าหมายไม่สามารถอยู่หลังกำบังทั้งหมดได้",
            "เวทที่มีส่วนประกอบที่เป็นวัตถุจะไม่บริโภควัตถุเหล่านั้นเว้นแต่จะระบุไว้อย่างชัดเจน หากไม่มีการระบุราคาของวัตถุ คุณสามารถสันนิษฐานได้ว่าราคานั้นน้อยนิดและสามารถหาได้จากกระเป๋าส่วนประกอบ",
            "เวทบางอย่างต้องการให้คุณรักษาสมาธิเพื่อให้เวทยังคงมีผลอยู่ หากคุณเสียสมาธิ เวทดังกล่าวจะสิ้นสุดลง คุณจะเสียสมาธิในการร่ายเวทหากคุณร่ายเวทอีกครั้งที่ต้องใช้สมาธิ หรือเมื่อคุณถูกทำให้หมดสติ ทุกครั้งที่คุณได้รับความเสียหาย คุณต้องทำการทดสอบการเซฟความทนทานเพื่อรักษาสมาธิของคุณ ค่า DC คือ 10 หรือครึ่งหนึ่งของความเสียหายที่คุณได้รับ แล้วแต่จำนวนใดจะสูงกว่า"
        ]
    },
    {
        title: "วิ่ง",
        icon: "sprint",
        subtitle: "เพิ่มความเร็วในการเคลื่อนที่เป็นสองเท่า",
        description: "เพิ่มการเคลื่อนที่เพิ่มเติมสำหรับเทิร์นนี้",
        reference: "PHB, หน้า 192.",
        bullets: [
            "การเพิ่มจะเท่ากับความเร็วของคุณ หลังจากการใช้ตัวปรับใดๆ"
        ]
    },
    {
        title: "ถอย",
        icon: "journey",
        subtitle: "ป้องกันการฉวยโอกาสโจมตี",
        description: "การเคลื่อนที่ของคุณจะไม่ก่อให้เกิดการโจมตีโอกาสในเทิร์นนี้",
        reference: "PHB, หน้า 192.",
        bullets: [
        ]
    },
    {
        title: "หลบหลีก",
        icon: "aura",
        subtitle: "เพิ่มการป้องกัน",
        description: "มุ่งเน้นการหลบเลี่ยงการโจมตีทั้งหมด",
        reference: "PHB, หน้า 192.",
        bullets: [
            "จนถึงเริ่มต้นเทิร์นถัดไปของคุณ การทอยโจมตีใดๆ ที่โจมตีคุณจะเสียเปรียบหากคุณสามารถเห็นผู้โจมตี และคุณจะทอยการเซฟความคล่องแคล่วด้วยความได้เปรียบ",
            "คุณจะสูญเสียประโยชน์นี้หากคุณถูกทำให้ <i>หมดสติ</i> หรือหากความเร็วของคุณลดลงเหลือ 0"
        ]
    },
    {
        title: "หลบหนี",
        icon: "manacles",
        subtitle: "หลุดจากการจับ",
        description: "หลุดจากการจับ",
        reference: "PHB, หน้า 195.",
        bullets: [
            "เพื่อหนีจากการจับ คุณต้องทำสำเร็จในการทดสอบความแข็งแกร่ง (กรีฑา) หรือความคล่องแคล่ว (กายกรรม) ที่แข่งขันกับการทดสอบความแข็งแกร่ง (กรีฑา) ของผู้จับ",
            "การหนีจากเงื่อนไขอื่นๆ ที่ตรึงคุณ (เช่น กุญแจมือ) อาจต้องใช้การทดสอบความคล่องแคล่วหรือความแข็งแกร่ง ตามที่ระบุโดยเงื่อนไขนั้น"
        ]
    },
    {
        title: "ช่วยเหลือ",
        icon: "telepathy",
        subtitle: "มอบความได้เปรียบให้แก่พันธมิตร",
        description: "มอบความได้เปรียบให้พันธมิตรในการตรวจสอบความสามารถหรือการโจมตี",
        reference: "PHB, หน้า 192.",
        bullets: [
            "เป้าหมายจะได้รับความได้เปรียบในการตรวจสอบความสามารถครั้งถัดไปที่มันทำเพื่อทำงานที่คุณช่วยเหลือ",
            "อีกทางหนึ่ง เป้าหมายจะได้รับความได้เปรียบในการโจมตีครั้งถัดไปต่อสิ่งมีชีวิตที่อยู่ในระยะ 5 ฟุตจากคุณ",
            "ความได้เปรียบจะคงอยู่จนถึงเริ่มต้นเทิร์นถัดไปของคุณ"
        ]
    },
    {
        title: "ใช้วัตถุ",
        icon: "snatch",
        subtitle: "โต้ตอบ, ใช้ความสามารถพิเศษของวัตถุ",
        description: "โต้ตอบกับวัตถุที่สองหรือใช้ความสามารถพิเศษของวัตถุ",
        reference: "PHB, หน้า 193.",
        bullets: [
            "คุณสามารถโต้ตอบกับวัตถุหนึ่งอย่างฟรีในระหว่างเทิร์นของคุณ (เช่น การดึงอาวุธหรือเปิดประตู) หากคุณต้องการโต้ตอบกับวัตถุที่สอง ใช้การกระทำนี้",
            "เมื่อวัตถุต้องการการกระทำของคุณในการใช้งาน คุณก็จะใช้การกระทำนี้เช่นกัน"
        ]
    },
    {
        title: "ใช้โล่",
        icon: "round-shield",
        subtitle: "ติดตั้งหรือถอดโล่",
        description: "ติดตั้งหรือถอดโล่",
        reference: "PHB, หน้า 144-146.",
        bullets: [
            "การติดตั้งหรือถอดโล่ใช้การกระทำเสมอ",
            "เกราะจะใช้เวลาหลายนาทีในการติดตั้งหรือถอด"
        ]
    },
    {
        title: "ซ่อน",
        icon: "hood",
        subtitle: "พยายามซ่อนตัว",
        description: "พยายามซ่อนตัว",
        reference: "PHB, หน้า 192.",
        bullets: [
            "คุณไม่สามารถซ่อนจากสิ่งมีชีวิตที่มองเห็นคุณได้ คุณต้องมีที่กำบังทั้งหมด อยู่ในพื้นที่ที่มืดมาก หายตัวไป หรือปิดกั้นการมองเห็นของศัตรูอย่างอื่น",
            "หากคุณทำให้เกิดเสียง (เช่นตะโกนเตือนหรือทำแจกันล้ม) คุณจะเปิดเผยตำแหน่งของคุณ",
            "เมื่อคุณพยายามซ่อน ให้ทำการทดสอบความคล่องแคล่ว (ซ่อนตัว) และจดผลลัพธ์ จนกว่าคุณจะถูกค้นพบหรือต้องหยุดซ่อน การทดสอบนี้จะถูกแข่งขันกับการทดสอบการสังเกต (การรับรู้) ของสิ่งมีชีวิตใดๆ ที่พยายามค้นหาสัญญาณการปรากฏตัวของคุณ",
            "สิ่งมีชีวิตจะสังเกตเห็นคุณแม้ว่ามันจะไม่ได้ค้นหา ยกเว้นว่าการทดสอบซ่อนตัวของคุณสูงกว่าการรับรู้เชิงพาสซีฟของมัน",
            "นอกการต่อสู้ คุณยังสามารถใช้การทดสอบความคล่องแคล่ว (ซ่อนตัว) เพื่อทำเช่น การซ่อนตัวจากศัตรู เดินลัดผ่านยาม หลบหนีโดยไม่ถูกสังเกต หรือย่องเข้าใกล้ใครบางคนโดยไม่ถูกเห็นหรือได้ยิน"
        ]
    },
    {
        title: "ค้นหา",
        icon: "magnifying-glass",
        subtitle: "ค้นหาอะไรบางอย่าง",
        description: "ทุ่มเทความสนใจเพื่อค้นหาบางอย่าง",
        reference: "PHB, หน้า 193.",
        bullets: [
            "ขึ้นอยู่กับลักษณะของการค้นหาของคุณ DM อาจให้คุณทำการทดสอบการรับรู้ (ปัญญา) หรือการสืบสวน (ปัญญา)"
        ]
    },
    {
        title: "เตรียมพร้อม",
        icon: "stopwatch",
        subtitle: "เลือกสิ่งที่เป็นตัวกระตุ้นและการตอบสนอง",
        description: "เลือกเหตุการณ์ที่มองเห็นได้เป็นตัวกระตุ้นและตอบสนองต่อสิ่งนั้น",
        reference: "PHB, หน้า 193.",
        bullets: [
            "ก่อนอื่น คุณต้องตัดสินใจว่าเหตุการณ์ใดจะเป็นตัวกระตุ้นการตอบสนองของคุณ",
            "จากนั้นคุณเลือกการกระทำที่จะทำเพื่อตอบสนองต่อเหตุการณ์นั้น หรือเลือกที่จะเคลื่อนที่เท่ากับความเร็วของคุณเพื่อตอบสนองต่อเหตุการณ์นั้น",
            "เมื่อเหตุการณ์เกิดขึ้น คุณสามารถเลือกที่จะใช้การตอบสนองของคุณทันทีหลังจากเหตุการณ์สิ้นสุดลงหรือเพิกเฉยต่อเหตุการณ์นั้น",
            "เมื่อคุณเตรียมพร้อมเพื่อร่ายเวท คุณจะร่ายเวทตามปกติแต่ค้างพลังไว้ ซึ่งคุณจะปล่อยด้วยการตอบสนองเมื่อเหตุการณ์นั้นเกิดขึ้น เวทที่จะถูกเตรียมพร้อมต้องมีเวลาร่าย 1 การกระทำ และการคงพลังเวทไว้ต้องใช้สมาธิ"
        ]
    },
    {
        title: "ใช้คุณสมบัติคลาส",
        icon: "embrassed-energy",
        subtitle: "คุณสมบัติบางอย่างใช้การกระทำ",
        description: "ใช้คุณสมบัติของคลาสหรือเผ่าพันธุ์ที่ใช้การกระทำ",
        reference: "ดูที่หน้าคลาสสำหรับข้อมูลเพิ่มเติม",
        bullets: [
        ]
    },
    {
        title: "รักษาความเสถียรสิ่งมีชีวิต",
        icon: "first-aid",
        subtitle: "ช่วยชีวิตสิ่งมีชีวิตที่กำลังจะตาย",
        description: "หยุดสิ่งมีชีวิตที่กำลังจะตายจากการทอยเซฟความตาย",
        reference: "PHB, หน้า 197.",
        bullets: [
            "ทำการทดสอบการรักษา (ปัญญา) ด้วยค่า DC 10",
            "หากสำเร็จ สิ่งมีชีวิตนั้นจะมีสถานะเสถียรและไม่ต้องทำการทอยเซฟความตายอีกต่อไป",
            "สิ่งมีชีวิตที่มีสถานะเสถียรจะฟื้น 1 แต้มชีวิตหลังจากผ่านไป 1d4 ชั่วโมง"
        ]
    },
    {
        title: "ด้นสด",
        icon: "juggler",
        subtitle: "การกระทำใดๆ ที่ไม่ได้อยู่ในรายการนี้",
        description: "ทำการกระทำใดๆ ที่คุณจินตนาการได้",
        reference: "PHB, หน้า 193.",
        bullets: [
            "เมื่อคุณอธิบายการกระทำที่ไม่ได้ระบุไว้ในกฎ DM จะบอกคุณว่าการกระทำนั้นเป็นไปได้หรือไม่ และจะต้องทอยลูกเต๋าประเภทใด หากต้องการ เพื่อกำหนดความสำเร็จหรือความล้มเหลว"
        ]
    }
]
