data_movement = [
    {
        title: "เคลื่อนที่",
        icon: "run",
        subtitle: "ค่า: 5ft ต่อ 5ft",
        description: "ค่าการเคลื่อนที่: 5ft ต่อการเดิน 5ft ",
        reference: "PHB, หน้า 190.",
        bullets: [
            "หากคุณมีความเร็วมากกว่าหนึ่งประเภท เช่น ความเร็วในการเดิน และความเร็วในการบิน คุณสามารถสลับไปมาระหว่างความเร็วต่าง ๆ ได้ ระหว่างการเคลื่อนที่ของคุณ เมื่อใดก็ตามที่คุณสลับ ให้ลบระยะทางที่คุณเคลื่อนไหวไปแล้วออกจากความเร็วใหม่",
            "คุณสามารถเคลื่อนผ่านพื้นที่ของสิ่งมีชีวิตที่ไม่เป็นศัตรูได้",
            "คุณสามารถเคลื่อนผ่านพื้นที่ของสิ่งมีชีวิตที่เป็นศัตรูได้ก็ต่อเมื่อสิ่งมีชีวิตนั้นมีขนาดใหญ่กว่าหรือเล็กกว่าคุณอย่างน้อยสองขนาด",
            "พื้นที่ของสิ่งมีชีวิตอื่นจะทำให้คุณเคลื่อนที่ยาก",
            "ไม่ว่าจะเป็นมิตรหรือศัตรู คุณไม่สามารถยุติการเคลื่อนที่ของคุณในพื้นที่ของสิ่งมีชีวิตอื่นได้"
        ]
    },
    {
        title: "ปีน",
        icon: "crags",
        subtitle: "ค่า: 10ft ต่อ 5ft",
        description: "ค่าการเคลื่อนที่: 10ft ต่อการปีน 5ft",
        reference: "PHB, หน้า 182.",
        bullets: [
            "อาจต้องมีการทดสอบค่า Strength (Athletics) ถ้าหากการปีนนั้นยาก"
        ]
    },
    {
        title: "ว่าย",
        icon: "at-sea",
        subtitle: "ค่า: 10ft ต่อ 5ft",
        description: "ค่าการเคลื่อนที่: 10ft ต่อการว่าย 5ft",
        reference: "PHB, หน้า 182.",
        bullets: [
            "อาจต้องมีการทดสอบค่า Strength (Athletics) ถ้าหากการว่ายนั้นยาก"
        ]
    },
    {
        title: "ล้มนอน",
        icon: "falling",
        subtitle: "ค่า: 0ft",
        description: "ค่าการเคลื่อนที่: 0ft (ฟรี)",
        reference: "PHB, หน้า 190-191,292.",
        bullets: [
            "คุณสามารถล้มตัวนอนได้โดยไม่ต้องใช้ความเร็วใด ๆ ของคุณ",
            "การเคลื่อนที่ขณะล้มตัวนอน คุณต้องคลาน หรือใช้เวทมนตร์เช่นการเคลื่อนย้ายเท่านั้น",
            "การล้มตัวนอนจะทำให้เกิดสถานะ <i>Prone</i> (การโจมตีระยะประชิดต่อคุณจะได้เปรียบ การโจมตีระยะไกลกับคุณจะเสียเปรียบ การโจมตีของคุณจะเสียเปรียบ)"
        ]
    },
    {
        title: "คลาน",
        icon: "crawl",
        subtitle: "ค่า: 10ft ต่อ 5ft",
        description: "ค่าการเคลื่อนที่: 10ft ต่อการคลาน 5ft",
        reference: "PHB, หน้า 182.",
        bullets: [

        ]
    },
    {
        title: "ยืน",
        icon: "strong",
        subtitle: "ค่า: ครึ่งนึงของความเร็วการเคลื่อนที่",
        description: "ค่าการเคลื่อนที่: ครึ่งนึงของความเร็วการเคลื่อนที่ของคุณ",
        reference: "PHB, หน้า 190-191.",
        bullets: [
            "คุณไม่สามารถลุกขึ้นยืนได้หากคุณไม่มีความเร็วมากพอหรือความเร็วของคุณเหลือ 0"
        ]
    },
    {
        title: "กระโดดสูง",
        icon: "wingfoot",
        subtitle: "ค่า: 5ft ต่อ 5ft",
        description: "ค่าการเคลื่อนที่: 5ft ต่อการกระโดด 5ft",

        reference: "PHB, หน้า 182.",
        bullets: [
            "หากคุณเคลื่อนที่อย่างน้อย 10 ฟุตก่อนการกระโดด คุณจะกระโดดขึ้นสู่อากาศเป็นระยะทางเท่ากับ <b>3 + ตัวปรับค่า Strength ของคุณ</b> ",
            "หากคุณกระโดดสูงจากการยืนนิ่ง คุณจะสามารถกระโดดได้เพียงครึ่งระยะทาง",
            "คุณสามารถยืดแขนของคุณขึ้นไปครึ่งหนึ่งของความสูงของตัวเองในระหว่างการกระโดด",
            "ในบางสถานการณ์ DM ของคุณอาจให้คุณทำการทดสอบ Strength (Athletics) เพื่อกระโดดให้สูงกว่าที่คุณทำได้ตามปกติ"
        ]
    },
    {
        title: "กระโดดไกล",
        icon: "wingfoot",
        subtitle: "ค่า: 5ft ต่อ 5ft",
        description: "ค่าการเคลื่อนที่: 5ft ต่อการกระโดด 5ft",
        reference: "PHB, หน้า 182.",
        bullets: [
            "หากคุณเคลื่อนที่อย่างน้อย 10 ฟุตก่อนการกระโดด คุณจะกระโดดได้เป็นระยะทางเท่ากับ <b>ค่า Strength ของคุณ</b>",
            "หากคุณกระโดดไกลจากการยืนนิ่ง คุณจะสามารถกระโดดได้เพียงครึ่งระยะทาง",
            "อาจต้องมีการทดสอบ DC 10 Strength (Athletics) เพื่อกระโดดผ่านสิ่งกีดขวางที่ไม่สูงมาก (ไม่สูงกว่า 1/4 ของระยะกระโดด) หากทดสอบไม่ผ่านคุณจะชนกับสิ่งกีดขวาง",
            "อาจต้องมีการทดสอบ DC 10 Dexterity (Acrobatics) เพื่อยืนในพื้นที่ที่ยากลำบาก คุณจะล้มลงนอนหากทดสอบไม่ผ่าน"
        ]
    },
    {
        title: "อิมโพรไวส์",
        icon: "juggler",
        subtitle: "การเคลื่อนไหวที่ไม่ได้ระบุไว้",
        description: "ทำการเคลื่อนไหวตามจินตนาการของคุณ",
        bullets: [
            "เมื่อคุณอธิบายการเคลื่อนที่ที่ไม่ระบุในกฎ DM จะบอกคุณว่าเป็นไปได้หรือไม่ และหากจำเป็น จะให้คุณทำการทดสอบเพื่อดูว่าคุณจะสำเร็จหรือไม่"
        ]
    },
    {
        title: "ภูมิประเทศที่ยากลำบาก",
        icon: "stone-pile",
        subtitle: "การปรับค่า: +5ft ต่อ 5ft",
        reference: "PHB, หน้า 182.",
        description: "การเคลื่อนที่ในพื้นที่ที่ยากลำบากต้องใช้การเคลื่อนที่เพิ่มขึ้น 5ft ต่อ 5ft",
        bullets: [
        ]
    },
    {
        title: "จับเคลื่อนที่",
        icon: "grab",
        subtitle: "การปรับค่า: ค่าความเร็วเหลือครึ่งเดียว",
        description: "ลากหรือพาสิ่งมีชีวิตที่ถูกจับติดตามไปกับคุณ",
        reference: "PHB, หน้า 195.",
        bullets: [
            "หากคุณเคลื่อนที่ขณะจับสิ่งมีชีวิตอีกตัวไว้ ความเร็วของคุณจะลดลงครึ่งหนึ่ง เว้นแต่ว่าสิ่งมีชีวิตนั้นจะมีขนาดเล็กกว่าคุณสองขนาดขึ้นไป",
            "ดูการโจมตีสำหรับวิธีการจับสิ่งมีชีวิต"
        ]
    }
]
