data_movement = [
    {
        title: "เดิน",
        icon: "run",
        subtitle: "Cost: 5ft per 5ft",
        description: "Movement cost: 5ft per 5ft moved",
        reference: "PHB, pg. 190.",
        bullets: [
            "หากคุณมีความเร็วมากกว่าหนึ่ง เช่น ความเร็วในการเดินและความเร็วในการบิน คุณสามารถสลับไปมาระหว่างความเร็วต่างๆ ระหว่างการเคลื่อนที่ของคุณ เมื่อใดก็ตามที่คุณสลับ ให้ลบระยะทางที่คุณเคลื่อนไหวไปแล้วออกจากความเร็วใหม่",
            "คุณสามารถเคลื่อนผ่านพื้นที่ของสิ่งมีชีวิตที่ไม่เป็นศัตรูได้",
            "คุณสามารถเคลื่อนผ่านพื้นที่ของสิ่งมีชีวิตที่เป็นศัตรูได้ก็ต่อเมื่อสิ่งมีชีวิตนั้นมีขนาดใหญ่กว่าหรือเล็กกว่าคุณอย่างน้อยสองขนาด",
            "พื้นที่ของสิ่งมีชีวิตอื่นเป็นพื้นที่ที่ยากสำหรับคุณ",
            "ไม่ว่าจะเป็นมิตรหรือศัตรู คุณไม่สามารถยุติการเคลื่อนที่ของคุณในพื้นที่ของสิ่งมีชีวิตอื่นได้"
        ]
    },
    {
        title: "ปีน",
        icon: "crags",
        subtitle: "Cost: 10ft per 5ft",
        description: "Movement cost: 10ft per 5ft climbed",
        reference: "PHB, pg. 182.",
        bullets: [
            "อาจต้องมีการทดสอบความแข็งแกร่ง (กรีฑา) หากการปีนยาก"
        ]
    },
    {
        title: "ว่าย",
        icon: "at-sea",
        subtitle: "Cost: 10ft per 5ft",
        description: "Movement cost: 10ft per 5ft swum",
        reference: "PHB, pg. 182.",
        bullets: [
            "อาจต้องมีการทดสอบความแข็งแกร่ง (กรีฑา) หากการว่ายน้ำยาก"
        ]
    },
    {
        title: "ก้มตัว",
        icon: "falling",
        subtitle: "Cost: 0ft",
        description: "Movement cost: 0ft (free)",
        reference: "PHB, pgs. 190-191,292.",
        bullets: [
            "คุณสามารถล้มตัวนอนได้โดยไม่ต้องใช้ความเร็วใด ๆ ของคุณ",
            "การเคลื่อนที่ขณะล้มตัวนอน คุณต้องคลานหรือใช้เวทมนตร์เช่นการเคลื่อนย้าย",
            "การล้มตัวนอนจะทำให้เกิดสถานะ <i>Prone</i> (การโจมตีระยะประชิดกับคุณได้เปรียบ, การโจมตีระยะไกลกับคุณเสียเปรียบ, การโจมตีของคุณเสียเปรียบ)"
        ]
    },
    {
        title: "คลาน",
        icon: "crawl",
        subtitle: "Cost: 10ft per 5ft",
        description: "Movement cost: 10ft per 5ft crawled",
        reference: "PHB, pg. 182.",
        bullets: [

        ]
    },
    {
        title: "ยืน",
        icon: "strong",
        subtitle: "Cost: half movement speed",
        description: "Movement cost: half of your speed",
        reference: "PHB, pg. 190-191.",
        bullets: [
            "คุณไม่สามารถลุกขึ้นได้หากคุณไม่มีความเร็วพอหรือความเร็วของคุณเป็น 0"
        ]
    },
    {
        title: "กระโดดสูง",
        icon: "wingfoot",
        subtitle: "Cost: 5ft per 5ft",
        description: "Movement cost: 5ft per 5ft jumped",

        reference: "PHB, pg. 182.",
        bullets: [
            "คุณกระโดดขึ้นสู่อากาศเป็นระยะทางเท่ากับ <b>3 + ตัวปรับความแข็งแกร่งของคุณ</b> หากคุณเคลื่อนที่อย่างน้อย 10 ฟุตก่อนการกระโดด",
            "เมื่อคุณกระโดดสูงจากท่าหยุดนิ่ง คุณสามารถกระโดดได้เพียงครึ่งระยะทางนั้น",
            "คุณสามารถยืดแขนของคุณขึ้นไปครึ่งหนึ่งของความสูงของตัวเองในระหว่างการกระโดด",
            "ในบางสถานการณ์ DM ของคุณอาจอนุญาตให้คุณทำการทดสอบความแข็งแกร่ง (กรีฑา) เพื่อกระโดดให้สูงกว่าที่คุณทำได้ตามปกติ"
        ]
    },
    {
        title: "กระโดดไกล",
        icon: "wingfoot",
        subtitle: "Cost: 5ft per 5ft",
        description: "Movement cost: 5ft per 5ft jumped",
        reference: "PHB, pg. 182.",
        bullets: [
            "คุณกระโดดได้เป็นระยะทางเท่ากับ <b>คะแนนความแข็งแกร่งของคุณ</b> หากคุณเคลื่อนที่อย่างน้อย 10 ฟุตก่อนการกระโดด",
            "เมื่อคุณกระโดดไกลจากท่าหยุดนิ่ง คุณสามารถกระโดดได้เพียงครึ่งระยะทางนั้น",
            "อาจต้องมีการทดสอบความแข็งแกร่ง (กรีฑา) DC 10 เพื่อลอดผ่านสิ่งกีดขวางต่ำ (ไม่สูงกว่าหนึ่งในสี่ของระยะกระโดด) คุณจะชนสิ่งกีดขวางหากทดสอบไม่ผ่าน",
            "อาจต้องมีการทดสอบความคล่องตัว (กายกรรม) DC 10 เพื่อยืนหยัดบนเท้าของคุณในพื้นที่ที่ยากลำบาก คุณจะล้มตัวนอนหากทดสอบไม่ผ่าน"
        ]
    },
    {
        title: "อิมโพรไวส์",
        icon: "juggler",
        subtitle: "Any stunt not on this list",
        description: "Perform any movement or stunt you can imagine",
        bullets: [
            "เมื่อคุณอธิบายการเคลื่อนที่ที่ไม่ระบุในกฎ DM จะบอกคุณว่าเป็นไปได้หรือไม่ และหากจำเป็นจะให้คุณทำการทดสอบเพื่อดูว่าคุณจะสำเร็จหรือไม่"
        ]
    },
    {
        title: "ภูมิประเทศที่ยากลำบาก",
        icon: "stone-pile",
        subtitle: "Cost modifier: +5ft per 5ft",
        reference: "PHB, pg. 182.",
        description: "การเคลื่อนที่ในพื้นที่ยากลำบากต้องใช้การเคลื่อนที่เพิ่มขึ้น 5ft ต่อ 5ft",
        bullets: [
        ]
    },
    {
        title: "จับเคลื่อนที่",
        icon: "grab",
        subtitle: "Modifier: speed halved",
        description: "ลากหรือพาสิ่งมีชีวิตที่ถูกจับติดตามไปกับคุณ",
        reference: "PHB, pg. 195.",
        bullets: [
            "หากคุณเคลื่อนที่ขณะจับสิ่งมีชีวิตอีกตัว ความเร็วของคุณจะลดลงครึ่งหนึ่ง เว้นแต่ว่าสิ่งมีชีวิตนั้นจะมีขนาดเล็กกว่าคุณสองขนาดขึ้นไป",
            "ดูการโจมตีเพื่อหาวิธีจับสิ่งมีชีวิต"
        ]
    }
]
