data_environment_obscurance = [
    {
        title: "พร่ามัว",
        icon: "bleeding-eye",
        subtitle: "เสียเปรียบในการรับรู้",
        description: "แสงสลัว หมอกปกคลุมเป็นหย่อมๆ ใบไม้ปกคลุมปานกลาง",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สิ่งมีชีวิตจะ<b>เสียเปรียบในการตรวจสอบ Wisdom (Perception)</b> ที่ต้องอาศัยการมองเห็น"
        ]
    },
    {
        title: "บดบัง",
        icon: "lightning-tear",
        subtitle: "บอดสนิท",
        description: "ความมืด, หมอกทึบ, ใบไม้หนาแน่น",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สิ่งมีชีวิตในพื้นที่ที่ถูกบดบังจะมีอาการ <b>ตาบอด</b>"
        ]
    }
]

data_environment_light = [
    {
        title: "แสงสว่าง",
        icon: "star-pupil",
        subtitle: "การมองเห็นปกติ",
        description: "แสงสว่างทำให้สิ่งมีชีวิตส่วนใหญ่มองเห็นได้ตามปกติ",
        reference: "คู่มือผู้เล่น, หน้า 183.",
        bullets: [
            "วันที่มีเมฆครึ้มยังคงให้แสงสว่าง เช่นเดียวกับคบเพลิง ตะเกียง กองไฟ และแหล่งกำเนิดแสงอื่นๆ ภายในรัศมีเฉพาะ"
        ]
    },
    {
        title: "แสงสลัว",
        icon: "semi-closed-eye",
        subtitle: "การบดบังเล็กน้อย",
        description: "แสงสลัว หรือเรียกว่าเงา",
        reference: "คู่มือผู้เล่น, หน้า 183.",
        bullets: [
            "สร้างพื้นที่ที่<b>มีการบดบังเล็กน้อย</b>",
            "พื้นที่ที่มีแสงสลัวมักเป็นขอบเขตระหว่างแหล่งกำเนิดแสงสว่าง เช่น คบเพลิง กับความมืดโดยรอบ",
            "แสงอ่อนๆ ในช่วงพลบค่ำและรุ่งอรุณก็นับเป็นแสงสลัวเช่นกัน พระจันทร์เต็มดวงที่สว่างเป็นพิเศษอาจทำให้พื้นที่เต็มไปด้วยแสงสลัว"
        ]
    },
    {
        title: "ความมืด",
        icon: "worried-eyes",
        subtitle: "การบดบังอย่างมาก",
        description: "ความมืดสร้างพื้นที่ที่มีการบดบังอย่างมาก",
        reference: "คู่มือผู้เล่น, หน้า 183.",
        bullets: [
            "สร้างพื้นที่ที่<b>มีการบดบังอย่างมาก</b>",
            "ตัวละครเผชิญกับความมืดในที่กลางแจ้งตอนกลางคืน (แม้แต่คืนที่มีแสงจันทร์ส่วนใหญ่) ภายในขอบเขตของดันเจี้ยนที่ไม่มีแสงสว่างหรือห้องใต้ดิน หรือในพื้นที่ที่มีความมืดจากเวทมนตร์"
        ]
    }
]

data_environment_vision = [
    {
        title: "การมองเห็นไร้ตา",
        icon: "one-eyed",
        subtitle: "รับรู้โดยไม่ต้องใช้การมองเห็น",
        description: "รับรู้สภาพแวดล้อมของคุณโดยไม่ต้องพึ่งพาการมองเห็น, ภายในรัศมีที่กำหนด",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สิ่งมีชีวิตที่ไม่มีตา เช่น เหลว หรือสิ่งมีชีวิตที่มีการตรวจจับเสียงสะท้อนหรือประสาทสัมผัสที่สูงขึ้น เช่น ค้างคาวและมังกรจริงๆ มีความรู้สึกนี้"
        ]
    },
    {
        title: "การมองเห็นในความมืด",
        icon: "semi-closed-eye",
        subtitle: "มองเห็นในความมืดที่จำกัด",
        description: "สิ่งมีชีวิตที่มีการมองเห็นในความมืดสามารถมองเห็นได้ดีขึ้นในความมืดหรือแสงน้อย, ภายในรัศมีที่กำหนด",
        reference: "PHB, หน้า 183-184.",
        bullets: [
            "ในระยะที่กำหนด, สิ่งมีชีวิตที่มีการมองเห็นในความมืดสามารถ <b>มองเห็นในความมืดราวกับว่าความมืดเป็นแสงจาง</b>, ดังนั้นพื้นที่ที่มืดจึงเป็นเพียงเบลอเล็กน้อยสำหรับสิ่งมีชีวิตนั้น",
            "อย่างไรก็ตาม, สิ่งมีชีวิตไม่สามารถแยกแยะสีในความมืดได้, สามารถเห็นแต่เฉดสีเทา",
            "สิ่งมีชีวิตหลายตัวในโลกของ D&D, โดยเฉพาะอย่างยิ่งสิ่งมีชีวิตที่อาศัยอยู่ใต้ดิน, มีการมองเห็นในความมืด"
        ]
    },
    {
        title: "การมองเห็นที่แท้จริง",
        icon: "eye-shield",
        subtitle: "มองเห็นในความมืด",
        description: "สิ่งมีชีวิตที่มีการมองเห็นที่แท้จริงสามารถเห็นทุกสิ่งในรูปแบบที่แท้จริง, ไม่ขึ้นอยู่กับสภาพแวดล้อม",
        reference: "PHB, หน้า 184.",
        bullets: [
            "สิ่งมีชีวิตที่มีการมองเห็นที่แท้จริงสามารถ, ในระยะที่กำหนด, มองเห็นในความมืดปกติและความมืดเวทมนตร์, มองเห็นสิ่งมีชีวิตและวัตถุที่มองไม่เห็น, ตรวจจับภาพลวงตาโดยอัตโนมัติและประสบความสำเร็จในการทอยเซฟกับพวกมัน, และรับรู้รูปแบบดั้งเดิมของผู้เปลี่ยนรูปร่างหรือสิ่งมีชีวิตที่ถูกเปลี่ยนโดยเวทมนตร์",
            "นอกจากนี้, สิ่งมีชีวิตยังสามารถมองเห็นเข้าสู่ Ethereal Plane ได้"
        ]
    }
]

data_environment_cover = [
    {
        title: "การกำบังเพียงครึ่งเดียว",
        icon: "broken-shield",
        subtitle: "กำแพงต่ำ, เฟอร์นิเจอร์, สิ่งมีชีวิต",
        description: "เป้าหมายจะอยู่ในที่การกำบังเพียงครึ่งเดียวหากสิ่งกีดขวางปิดบังร่างกายของมันอย่างน้อยครึ่งหนึ่ง",
        reference: "PHB, หน้า 196.",
        bullets: [
            "สิ่งกีดขวางอาจเป็นกำแพงเตี้ย เฟอร์นิเจอร์ชิ้นใหญ่ ลำต้นไม้ขนาดเล็ก หรือสิ่งมีชีวิต ไม่ว่าสิ่งมีชีวิตนั้นจะเป็นศัตรูหรือพันธมิตรก็ตาม",
            "เป้าหมายที่มีการกำบังเพียงครึ่งเดียวจะได้รับ <b>โบนัส +2 AC และการทอยเซฟ Dexterity</b>.",
            "หากเป้าหมายอยู่หลังแหล่งที่กำบังหลายแหล่ง ให้ใช้ระดับการป้องกันที่มีประสิทธิภาพสูงสุดเท่านั้น"
        ]
    },
    {
        title: "การกำบังสามในสี่",
        icon: "cracked-shield",
        subtitle: "ประตูเหล็ก, ช่องลูกธนู",
        description: "เป้าหมายจะอยู่ในที่กำบังสามส่วนสี่ หากประมาณสามส่วนสี่ของมันถูกปกคลุมด้วยสิ่งกีดขวาง",
        reference: "PHB, หน้า 196.",
        bullets: [
            "สิ่งกีดขวางอาจเป็นประตูตะแกรงเหล็ก ช่องยิงธนู หรือลำต้นไม้ขนาดใหญ่",
            "เป้าหมายที่มีที่กำบังสามส่วนสี่จะได้รับ <b>โบนัส +5 AC และการทอยเซฟ Dexterity</b>.",
            "หากเป้าหมายอยู่หลังแหล่งที่กำบังหลายแหล่ง ให้ใช้ระดับการป้องกันที่มีประสิทธิภาพสูงสุดเท่านั้น"
        ]
    },
    {
        title: "การกำบังที่สมบูรณ์",
        icon: "shield",
        subtitle: "ซ่อนตัวทั้งหมด",
        description: "เป้าหมายจะอยู่ในที่กำบังสมบูรณ์หากถูกบดบังอย่างสิ้นเชิงด้วยสิ่งกีดขวาง",
        reference: "PHB, หน้า 196.",
        bullets: [
            "เป้าหมายที่มีที่กำบังสมบูรณ์ <b>ไม่สามารถถูกเล็งเป็นเป้าหมาย</b> ของการโจมตีหรือใช้เวทย์มนตร์ แม้ว่าบางเวทย์มนตร์จะสามารถเข้าถึงเป้าหมายได้โดยการที่มีเป้าหมายอยู่ภายในพื้นที่ของเวทย์มนตร์นั้น.",
            "หากเป้าหมายอยู่หลังแหล่งที่กำบังหลายแหล่ง ให้ใช้ระดับการป้องกันที่มีประสิทธิภาพสูงสุดเท่านั้น"
        ]
    }
]
