data_environment_obscurance = [
    {
        title: "พร่ามัว",
        icon: "bleeding-eye",
        subtitle: "เสียเปรียบในการรับรู้",
        description: "แสงจาง, หมอกเป็นหย่อมๆ, ใบไม้ปานกลาง",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สิ่งมีชีวิตจะ<b>เสียเปรียบในการตรวจสอบ Wisdom (Perception)</b> ที่ต้องอาศัยการมองเห็น"
        ]
    },
    {
        title: "บดบัง",
        icon: "lightning-tear",
        subtitle: "บอดสนิท",
        description: "ความมืด, หมอกทึบ, ใบไม้หนาแน่น",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สิ่งมีชีวิตในพื้นที่ที่ถูกบดบังจะมีอาการ <b>ตาบอด</b>"
        ]
    }
]

data_environment_light = [
    {
        title: "แสงสว่าง",
        icon: "star-pupil",
        subtitle: "การมองเห็นปกติ",
        description: "แสงสว่างทำให้สิ่งมีชีวิตส่วนใหญ่เห็นได้ตามปกติ",
        reference: "PHB, หน้า 183.",
        bullets: [
            "วันมืดครึ้มยังให้แสงสว่างได้ รวมถึงคบไฟ, โคมไฟ, ไฟ, และแหล่งแสงอื่นๆ ภายในรัศมีที่กำหนด"
        ]
    },
    {
        title: "แสงจาง",
        icon: "semi-closed-eye",
        subtitle: "เบลอเล็กน้อย",
        description: "แสงจาง หรือที่เรียกว่าหมายถึงเงา",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สร้างพื้นที่ <b>เบลอเล็กน้อย</b>",
            "พื้นที่แสงจางมักจะเป็นเขตแดนระหว่างแหล่งแสงสว่าง เช่น คบไฟ กับความมืดที่ล้อมรอบ",
            "แสงที่อ่อนของช่วงรุ่งอรุณและพระอาทิตย์ตกดินก็นับเป็นแสงจาง การมีแสงจากพระจันทร์เต็มดวงที่สดใสอาจให้แสงจางแก่พื้นที่"
        ]
    },
    {
        title: "ความมืด",
        icon: "worried-eyes",
        subtitle: "เบลอมาก",
        description: "ความมืดสร้างพื้นที่เบลอมาก",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สร้างพื้นที่ <b>เบลอมาก</b>",
            "ตัวละครเผชิญกับความมืดในตอนกลางคืน (แม้แต่คืนที่มีแสงจันทร์), ภายในดันเจี้ยนที่ไม่ได้ให้แสงสว่าง หรือในพื้นที่ที่มีความมืดเวทมนตร์"
        ]
    }
]

data_environment_vision = [
    {
        title: "การมองเห็นไร้ตา",
        icon: "one-eyed",
        subtitle: "รับรู้โดยไม่ต้องใช้การมองเห็น",
        description: "รับรู้สภาพแวดล้อมของคุณโดยไม่ต้องพึ่งพาการมองเห็น, ภายในรัศมีที่กำหนด",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สิ่งมีชีวิตที่ไม่มีตา เช่น เหลว หรือสิ่งมีชีวิตที่มีการตรวจจับเสียงสะท้อนหรือประสาทสัมผัสที่สูงขึ้น เช่น ค้างคาวและมังกรจริงๆ มีความรู้สึกนี้"
        ]
    },
    {
        title: "การมองเห็นในความมืด",
        icon: "semi-closed-eye",
        subtitle: "มองเห็นในความมืดที่จำกัด",
        description: "สิ่งมีชีวิตที่มีการมองเห็นในความมืดสามารถมองเห็นได้ดีขึ้นในความมืดหรือแสงน้อย, ภายในรัศมีที่กำหนด",
        reference: "PHB, หน้า 183-184.",
        bullets: [
            "ในระยะที่กำหนด, สิ่งมีชีวิตที่มีการมองเห็นในความมืดสามารถ <b>มองเห็นในความมืดราวกับว่าความมืดเป็นแสงจาง</b>, ดังนั้นพื้นที่ที่มืดจึงเป็นเพียงเบลอเล็กน้อยสำหรับสิ่งมีชีวิตนั้น",
            "อย่างไรก็ตาม, สิ่งมีชีวิตไม่สามารถแยกแยะสีในความมืดได้, สามารถเห็นแต่เฉดสีเทา",
            "สิ่งมีชีวิตหลายตัวในโลกของ D&D, โดยเฉพาะอย่างยิ่งสิ่งมีชีวิตที่อาศัยอยู่ใต้ดิน, มีการมองเห็นในความมืด"
        ]
    },
    {
        title: "การมองเห็นที่แท้จริง",
        icon: "eye-shield",
        subtitle: "มองเห็นในความมืด",
        description: "สิ่งมีชีวิตที่มีการมองเห็นที่แท้จริงสามารถเห็นทุกสิ่งในรูปแบบที่แท้จริง, ไม่ขึ้นอยู่กับสภาพแวดล้อม",
        reference: "PHB, หน้า 184.",
        bullets: [
            "สิ่งมีชีวิตที่มีการมองเห็นที่แท้จริงสามารถ, ในระยะที่กำหนด, มองเห็นในความมืดปกติและความมืดเวทมนตร์, มองเห็นสิ่งมีชีวิตและวัตถุที่มองไม่เห็น, ตรวจจับภาพลวงตาโดยอัตโนมัติและประสบความสำเร็จในการทอยเซฟกับพวกมัน, และรับรู้รูปแบบดั้งเดิมของผู้เปลี่ยนรูปร่างหรือสิ่งมีชีวิตที่ถูกเปลี่ยนโดยเวทมนตร์",
            "นอกจากนี้, สิ่งมีชีวิตยังสามารถมองเห็นเข้าสู่ Ethereal Plane ได้"
        ]
    }
]

data_environment_cover = [
    {
        title: "ครึ่งหนึ่งของการป้องกัน",
        icon: "broken-shield",
        subtitle: "กำแพงต่ำ, เฟอร์นิเจอร์, สิ่งมีชีวิต",
        description: "เป้าหมายมีการป้องกันครึ่งหนึ่งหากอุปสรรคบังร่างกายอย่างน้อยครึ่งหนึ่ง",
        reference: "PHB, หน้า 196.",
        bullets: [
            "อุปสรรคอาจเป็นกำแพงต่ำ, เฟอร์นิเจอร์ขนาดใหญ่, ลำต้นต้นไม้แคบๆ, หรือสิ่งมีชีวิตไม่ว่าจะเป็นศัตรูหรือเพื่อน.",
            "เป้าหมายที่มีการป้องกันครึ่งหนึ่งมี <b>โบนัส +2 ต่อ AC และการทอยเซฟ Dexterity</b>.",
            "หากเป้าหมายอยู่หลังหลายแหล่งการป้องกัน, เพียงแค่ระดับการป้องกันที่ป้องกันได้ดีที่สุดจะนำมาใช้"
        ]
    },
    {
        title: "สามในสี่ของการป้องกัน",
        icon: "cracked-shield",
        subtitle: "ประตูเหล็ก, ช่องลูกธนู",
        description: "เป้าหมายมีการป้องกันสามในสี่หากประมาณสามในสี่ของมันถูกปิดโดยอุปสรรค",
        reference: "PHB, หน้า 196.",
        bullets: [
            "อุปสรรคอาจเป็นประตูเหล็ก, ช่องลูกธนู, หรือลำต้นต้นไม้หนา.",
            "เป้าหมายที่มีการป้องกันสามในสี่มี <b>โบนัส +5 ต่อ AC และการทอยเซฟ Dexterity</b>.",
            "หากเป้าหมายอยู่หลังหลายแหล่งการป้องกัน, เพียงแค่ระดับการป้องกันที่ป้องกันได้ดีที่สุดจะนำมาใช้"
        ]
    },
    {
        title: "การป้องกันทั้งหมด",
        icon: "shield",
        subtitle: "ซ่อนตัวทั้งหมด",
        description: "เป้าหมายมีการป้องกันทั้งหมดหากมันถูกซ่อนไว้ทั้งหมดโดยอุปสรรค",
        reference: "PHB, หน้า 196.",
        bullets: [
            "เป้าหมายที่มีการป้องกันทั้งหมด <b>ไม่สามารถถูกโจมตีโดยตรง</b> โดยการโจมตีหรือเวทมนตร์, แม้ว่าบางเวทมนตร์สามารถเข้าถึงเป้าหมายดังกล่าวโดยการรวมมันในพื้นที่ของผลกระทบ.",
            "หากเป้าหมายอยู่หลังหลายแหล่งการป้องกัน, เพียงแค่ระดับการป้องกันที่ป้องกันได้ดีที่สุดจะนำมาใช้"
        ]
    }
]
