data_environment_obscurance = [
    {
        title: "พร่ามัว",
        icon: "bleeding-eye",
        subtitle: "เสียเปรียบในการรับรู้",
        description: "แสงสลัว หมอกปกคลุมเป็นหย่อมๆ ใบไม้ปกคลุมปานกลาง",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สิ่งมีชีวิตจะ<b>เสียเปรียบในการตรวจสอบ Wisdom (Perception)</b> ที่ต้องอาศัยการมองเห็น"
        ]
    },
    {
        title: "บดบัง",
        icon: "lightning-tear",
        subtitle: "บอดสนิท",
        description: "ความมืด, หมอกทึบ, ใบไม้หนาแน่น",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สิ่งมีชีวิตในพื้นที่ที่ถูกบดบังจะมีอาการ <b>ตาบอด</b>"
        ]
    }
]

data_environment_light = [
    {
        title: "แสงสว่างจ้า",
        icon: "star-pupil",
        subtitle: "การมองเห็นปกติ",
        description: "แสงสว่างทำให้สิ่งมีชีวิตส่วนใหญ่เห็นได้ตามปกติ",
        reference: "PHB, หน้า 183.",
        bullets: [
            "วันที่มืดครึ้มยังคงมีแสงสว่าง ทั้งนี้รวมไปถึงคบไฟ โคมไฟ เปลวไฟ และแหล่งให้แสงสว่างอื่นๆ ภายในรัศมีที่กำหนด"
        ]
    },
    {
        title: "แสงสลัว",
        icon: "semi-closed-eye",
        subtitle: "เบลอเล็กน้อย",
        description: "แสงสลัว หรือหมายถึงเงา",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สร้างพื้นที่ <b>พร่ามัว</b>",
            "พื้นที่แสงสลัวมักจะเป็นพื้นที่ระหว่างแสงสว่างจ้า เช่น คบไฟ กับความมืดที่ล้อมรอบ",
            "แสงอ่อนๆ ของช่วงรุ่งอรุณ และพระอาทิตย์ตกดินก็นับเป็นแสงสลัว การมีแสงจากพระจันทร์เต็มดวงที่สดใสอาจให้แสงสลัวแก่พื้นที่"
        ]
    },
    {
        title: "มืดมิด",
        icon: "worried-eyes",
        subtitle: "เบลอมาก",
        description: "ความมืดสร้างพื้นที่เบลอมาก",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สร้างพื้นที่ <b>เบลอมาก</b>",
            "ตัวละครเผชิญกับความมืดในตอนกลางคืน (แม้แต่คืนที่มีแสงจันทร์) ภายในดันเจี้ยนที่ไม่ได้ให้แสงสว่าง หรือในพื้นที่ที่มีเวทมนตร์ความมืด"
        ]
    }
]

data_environment_vision = [
    {
        title: "การมองเห็นแบบไม่ใช้ตา",
        icon: "one-eyed",
        subtitle: "รับรู้โดยไม่ใช้การมองเห็น",
        description: "รับรู้สิ่งรอบตัวโดยไม่ต้องอาศัยการมองเห็น ภายในรัศมีที่กำหนด",
        reference: "PHB, หน้า 183.",
        bullets: [
            "สิ่งมีชีวิตที่ไม่มีตา เช่น สไลม์ และสิ่งมีชีวิตที่มีการหาตำแหน่งด้วยเสียงสะท้อนหรือประสาทสัมผัสที่เฉียบคม เช่น ค้างคาวและมังกรที่แท้จริง มีความสามารถในการรับรู้นี้"
        ]
    },
    {
        title: "การมองเห็นในความมืด",
        icon: "semi-closed-eye",
        subtitle: "การมองเห็นที่จำกัดในความมืด",
        description: "สิ่งมีชีวิตที่มีการมองเห็นในความมืดสามารถมองเห็นได้ดีขึ้นในสภาวะมืดหรือแสงน้อย ภายในรัศมีที่กำหนด",
        reference: "PHB, หน้า 183-184.",
        bullets: [
            "ภายในระยะที่กำหนด สิ่งมีชีวิตที่มีการมองเห็นในความมืดสามารถ<b>มองเห็นในความมืดเสมือนว่าความมืดนั้นเป็นแสงสลัว</b> ดังนั้นพื้นที่มืดจึงถูกบดบังเพียงเล็กน้อยสำหรับสิ่งมีชีวิตนั้น",
            "อย่างไรก็ตาม สิ่งมีชีวิตไม่สามารถแยกแยะสีในความมืดได้ เห็นได้เพียงเฉดสีเทาเท่านั้น",
            "สิ่งมีชีวิตจำนวนมากในโลกของ D&D โดยเฉพาะอย่างยิ่ง ที่อาศัยอยู่ใต้ดิน จะมีการมองเห็นในความมืด"
        ]
    },
    {
        title: "การมองเห็นแที่ท้จริง",
        icon: "eye-shield",
        subtitle: "มองเห็นในความมืด",
        description: "สิ่งมีชีวิตที่มีการมองเห็นที่แท้จริงสามารถเห็นทุกสิ่งในรูปแบบที่แท้จริง โดยไม่ขึ้นกับสภาพแวดล้อม",
        reference: "PHB, หน้า 184.",
        bullets: [
            "สิ่งมีชีวิตที่มีการมองเห็นที่แท้จริงสามารถมองเห็นในความมืดปกติและเวทมนตร์ความมืด เห็นสิ่งมีชีวิตและวัตถุที่มองไม่เห็น ตรวจจับภาพลวงตาทางสายตาโดยอัตโนมัติ และจะประสบความสำเร็จในการทอยเซฟต่อต้านภาพลวงตาเหล่านั้น และรับรู้รูปแบบดั้งเดิมของผู้เปลี่ยนรูปร่างหรือสิ่งมีชีวิตที่ถูกแปลงร่างด้วยเวทมนตร์ ภายในระยะที่กำหนด",
            "นอกจากนี้ สิ่งมีชีวิตยังสามารถมองเห็นเข้าไปในอีเธอเรียลเพลนได้"
        ]
    }
]

data_environment_cover = [
    {
        title: "การกำบังเพียงครึ่งเดียว",
        icon: "broken-shield",
        subtitle: "กำแพงต่ำ, เฟอร์นิเจอร์, สิ่งมีชีวิต",
        description: "เป้าหมายจะอยู่ในที่การกำบังเพียงครึ่งเดียวหากสิ่งกีดขวางปิดบังร่างกายของมันอย่างน้อยครึ่งหนึ่ง",
        reference: "PHB, หน้า 196.",
        bullets: [
            "สิ่งกีดขวางอาจเป็นกำแพงเตี้ย เฟอร์นิเจอร์ชิ้นใหญ่ ลำต้นไม้ขนาดเล็ก หรือสิ่งมีชีวิต ไม่ว่าสิ่งมีชีวิตนั้นจะเป็นศัตรูหรือพันธมิตรก็ตาม",
            "เป้าหมายที่มีการกำบังเพียงครึ่งเดียวจะได้รับ <b>โบนัส +2 AC และการทอยเซฟ Dexterity</b>.",
            "หากเป้าหมายอยู่หลังแหล่งที่กำบังหลายแหล่ง ให้ใช้ระดับการป้องกันที่มีประสิทธิภาพสูงสุดเท่านั้น"
        ]
    },
    {
        title: "การกำบังสามในสี่",
        icon: "cracked-shield",
        subtitle: "ประตูเหล็ก, ช่องลูกธนู",
        description: "เป้าหมายจะอยู่ในที่กำบังสามส่วนสี่ หากประมาณสามส่วนสี่ของมันถูกปกคลุมด้วยสิ่งกีดขวาง",
        reference: "PHB, หน้า 196.",
        bullets: [
            "สิ่งกีดขวางอาจเป็นประตูตะแกรงเหล็ก ช่องยิงธนู หรือลำต้นไม้ขนาดใหญ่",
            "เป้าหมายที่มีที่กำบังสามส่วนสี่จะได้รับ <b>โบนัส +5 AC และการทอยเซฟ Dexterity</b>.",
            "หากเป้าหมายอยู่หลังแหล่งที่กำบังหลายแหล่ง ให้ใช้ระดับการป้องกันที่มีประสิทธิภาพสูงสุดเท่านั้น"
        ]
    },
    {
        title: "การกำบังที่สมบูรณ์",
        icon: "shield",
        subtitle: "ซ่อนตัวทั้งหมด",
        description: "เป้าหมายจะอยู่ในที่กำบังสมบูรณ์หากถูกบดบังอย่างสิ้นเชิงด้วยสิ่งกีดขวาง",
        reference: "PHB, หน้า 196.",
        bullets: [
            "เป้าหมายที่มีที่กำบังสมบูรณ์ <b>ไม่สามารถถูกเล็งเป็นเป้าหมาย</b> ของการโจมตีหรือใช้เวทย์มนตร์ แม้ว่าบางเวทย์มนตร์จะสามารถเข้าถึงเป้าหมายได้โดยการที่มีเป้าหมายอยู่ภายในพื้นที่ของเวทย์มนตร์นั้น.",
            "หากเป้าหมายอยู่หลังแหล่งที่กำบังหลายแหล่ง ให้ใช้ระดับการป้องกันที่มีประสิทธิภาพสูงสุดเท่านั้น"
        ]
    }
]
