data_bonusaction = [
    {
        title: "โจมตีมือรอง",
        icon: "crossed-swords",
        subtitle: "ใช้ร่วมกับการกระทำโจมตี",
        description: "โจมตีด้วยมือรองของคุณ",
        reference: "PHB, หน้า 192, 194-195.",
        bullets: [
            "ใช้ได้เฉพาะเมื่อคุณใช้การกระทำ <i>โจมตี</i> และโจมตีด้วยอาวุธระยะประชิดเบาที่คุณถือในมือข้างหนึ่ง",
            "ทำการโจมตีครั้งเดียวด้วยอาวุธระยะประชิดเบาอีกอันที่คุณถือในมืออีกข้าง",
            "คุณจะไม่เพิ่มตัวปรับความสามารถของคุณไปยังความเสียหายจากการโจมตีโบนัส ยกเว้นว่าตัวปรับนั้นเป็นลบ",
            "หากอาวุธใดมีคุณสมบัติขว้าง คุณสามารถขว้างอาวุธแทนการโจมตีระยะประชิดได้"
        ]
    },
    {
        title: "ร่ายเวท",
        icon: "magic-swirl",
        subtitle: "เวลาร่าย 1 การกระทำโบนัส",
        description: "ร่ายเวทที่มีเวลาร่าย 1 การกระทำโบนัส",
        reference: "PHB, หน้า 192.",
        bullets: [
            "คุณไม่สามารถร่ายเวทด้วยการกระทำของคุณและเวทอื่นที่แตกต่างกันด้วยการกระทำโบนัสของคุณในเทิร์นเดียวกัน ยกเว้นว่าการกระทำนั้นใช้ในการร่ายแคนทริป",
            "สำหรับรายละเอียดเพิ่มเติม ดูที่การกระทำ <i>ร่ายเวท</i>"
        ]
    },
    {
        title: "ใช้คุณสมบัติคลาส",
        icon: "embrassed-energy",
        subtitle: "คุณสมบัติบางอย่างใช้การกระทำโบนัส",
        description: "ใช้คุณสมบัติของเผ่าพันธุ์หรือคลาสที่ใช้การกระทำโบนัส",
        reference: "ดูที่หน้าคลาสสำหรับข้อมูลเพิ่มเติม",
        bullets: [
        ]
    }
]
