data_reaction = [
    {
        title: "การโจมตีโอกาส",
        icon: "crossed-swords",
        subtitle: "ศัตรูออกจากระยะโจมตีของคุณ",
        description: "คุณไม่สามารถเคลื่อนไหวผ่านศัตรูได้อย่างปลอดภัยโดยไม่ทำให้ตัวเองตกอยู่ในอันตราย",
        reference: "PHB, หน้า 195.",
        bullets: [
            "เงื่อนไข: สิ่งมีชีวิตศัตรูที่คุณมองเห็นออกจากระยะโจมตีของคุณ.",
            "ทำการโจมตีระยะประชิดหนึ่งครั้งต่อสิ่งมีชีวิตที่ก่อเหตุ.",
            "การโจมตีจะขัดขวางการเคลื่อนไหวของสิ่งมีชีวิตที่ก่อเหตุ ซึ่งเกิดขึ้นก่อนที่สิ่งมีชีวิตนั้นจะออกจากระยะโจมตีของคุณ.",
            "สิ่งมีชีวิตจะไม่ก่อให้เกิดการโจมตีโอกาสเมื่อมันเทเลพอร์ต หรือเมื่อมีคนหรือสิ่งใดเคลื่อนย้ายมันโดยไม่ใช้การเคลื่อนไหว การกระทำ หรือการตอบสนอง."
        ]
    },
    {
        title: "การกระทำที่เตรียมไว้",
        icon: "stopwatch",
        subtitle: "เป็นส่วนหนึ่งของการเตรียมพร้อม",
        description: "ทำการตอบสนองตามที่ระบุไว้ในการเตรียมพร้อมของคุณ",
        reference: "PHB, หน้า 193.",
        bullets: [
            "เงื่อนไข: ระบุไว้ในการกระทำ <i>เตรียมพร้อม</i> ของคุณ."
        ]
    },
    {
        title: "ร่ายเวท",
        icon: "magic-swirl",
        subtitle: "ร่ายเวทที่ใช้เวลา 1 การตอบสนอง",
        description: "ร่ายเวทที่มีเวลาร่ายเป็น 1 การตอบสนอง",
        reference: "PHB, หน้า 192.",
        bullets: [
            "เงื่อนไข: ระบุโดยเวทมนตร์.",
            "สำหรับรายละเอียดเพิ่มเติม, ดูการกระทำ <i>ร่ายเวท</i>."
        ]
    }
]
