data_condition = [
    {
        title: "ตาบอด",
        icon: "one-eyed",
        subtitle: "คุณไม่สามารถมองเห็น",
        description: "คุณไม่สามารถมองเห็น",
        reference: "PHB, หน้า 290.",
        bullets: [
            "คุณล้มเหลวในการตรวจสอบความสามารถใดๆ ที่ต้องใช้การมองเห็นโดยอัตโนมัติ",
            "คุณเสียเปรียบในการทอยโจมตี",
            "การโจมตีจะได้เปรียบต่อคุณ"
        ]
    },
    {
        title: "หลงเสน่ห์",
        icon: "smitten",
        subtitle: "คุณถูกทำให้หลงเสน่ห์",
        description: "คุณถูกทำให้หลงเสน่ห์โดยสิ่งมีชีวิตอื่น",
        reference: "PHB, หน้า 290.",
        bullets: [
            "คุณไม่สามารถโจมตีผู้ที่หลงเสน่ห์คุณหรือใช้ความสามารถหรือเวทมนตร์ที่เป็นอันตรายกับพวกเขาได้",
            "สิ่งมีชีวิตที่คุณหลงเสน่ห์จะได้เปรียบการตรวจสอบความสามารถในการโต้ตอบทางสังคมกับคุณ"
        ]
    },
    {
        title: "หูหนวก",
        icon: "elf-ear",
        subtitle: "คุณไม่ได้ยิน",
        description: "คุณไม่ได้ยิน",
        reference: "PHB, หน้า 290.",
        bullets: [
            "คุณล้มเหลวในการตรวจสอบความสามารถใดๆ ที่ต้องใช้การได้ยินโดยอัตโนมัติ"
        ]
    },
    {
        title: "ความเหนื่อยล้า",
        icon: "crawl",
        subtitle: "คุณเหนื่อยล้า",
        description: "ความเหนื่อยล้าวัดได้เป็น 6 ระดับ",
        reference: "PHB, หน้า 291.",
        bullets: [
            "<table><tr><th>ระดับ</th><th></th><th></th><th style='text-align:left'>ผลกระทบ</th></tr><tr><td>1</td><td></td><td></td><td>เสียเปรียบในการตรวจสอบความสามารถ</td></tr><tr><td>2</td><td></td><td></td><td>ความเร็วลดลงครึ่งหนึ่ง</td></tr><tr><td>3</td><td></td><td></td><td>เสียเปรียบในการทอยโจมตีและการทอยเซฟ</td></tr><tr><td>4</td><td></td><td></td><td>จุดชีวิตสูงสุดลดลงครึ่งหนึ่ง</td></tr><tr><td>5</td><td></td><td></td><td>ความเร็วลดลงเหลือ 0</td></tr><tr><td>6</td><td></td><td></td><td>ตาย</td></tr></table>",
            "คุณได้รับผลกระทบจากระดับความเหนื่อยล้าปัจจุบันของคุณรวมถึงทุกระดับที่ต่ำกว่า",
            "การพักระยะยาวเสร็จสิ้นจะลดระดับความเหนื่อยล้าของคุณลง 1 ระดับ หากคุณได้รับอาหารและเครื่องดื่ม",
            "การฟื้นคืนชีพจากความตายก็ลดระดับความเหนื่อยล้าของสิ่งมีชีวิตลง 1 ระดับเช่นกัน"
        ]
    },
    {
        title: "กลัว",
        icon: "sharp-smile",
        subtitle: "คุณกลัว",
        description: "คุณกลัว",
        reference: "PHB, หน้า 290.",
        bullets: [
            "คุณเสียเปรียบในการตรวจสอบความสามารถและการทอยโจมตีขณะที่แหล่งของความกลัวอยู่ในสายตา",
            "คุณไม่สามารถเคลื่อนที่เข้าใกล้แหล่งที่มาของความกลัวได้ตามความสมัครใจ"
        ]
    },
    {
        title: "ถูกจับยึด",
        icon: "grab",
        subtitle: "คุณถูกจับยึด",
        description: "คุณถูกจับยึด",
        reference: "PHB, หน้า 290.",
        bullets: [
            "ความเร็วของคุณกลายเป็น 0 และคุณไม่สามารถได้รับประโยชน์จากโบนัสใดๆ ที่เพิ่มความเร็วได้",
            "สถานะนี้สิ้นสุดลงหากผู้จับของคุณไร้ความสามารถ",
            "สถานะนี้ยังสิ้นสุดลงหากคุณถูกย้ายออกจากการเข้าถึงของผู้จับของคุณ"
        ]
    },
    {
        title: "ไร้ความสามารถ",
        icon: "internal-injury",
        subtitle: "คุณไม่สามารถทำการกระทำหรือปฏิกิริยา",
        description: "คุณไม่สามารถทำการกระทำหรือปฏิกิริยา",
        reference: "PHB, หน้า 290.",
        bullets: []
    },
    {
        title: "ล่องหน",
        icon: "invisible",
        subtitle: "คุณไม่สามารถมองเห็น",
        description: "คุณไม่สามารถมองเห็นได้โดยปราศจากเวทมนตร์หรือประสาทสัมผัสพิเศษ",
        reference: "PHB, หน้า 291.",
        bullets: [
            "เพื่อการซ่อนตัว คุณถูกบดบังอย่างหนัก",
            "คุณยังคงถูกตรวจพบได้ด้วยเสียงที่คุณสร้างหรือรอยเท้าที่คุณทิ้งไว้",
            "คุณได้เปรียบในการทอยโจมตี",
            "การทอยโจมตีต่อคุณเสียเปรียบ"
        ]
    },
    {
        title: "เป็นอัมพาต",
        icon: "internal-injury",
        subtitle: "คุณเป็นอัมพาต",
        description: "คุณไม่สามารถทำอะไรได้",
        bullets: [
            "คุณไร้ความสามารถและไม่สามารถเคลื่อนไหวหรือพูดได้",
            "การทอยโจมตีต่อคุณได้เปรียบ",
            "การโจมตีใดๆ ที่โดนคุณเป็นการโจมตีคริติคอลหากผู้โจมตีอยู่ภายในระยะ 5 ฟุต",
            "คุณล้มเหลวในการทอยเซฟ Strength และ Dexterity โดยอัตโนมัติ"
        ]
    },
    {
        title: "กลายเป็นหิน",
        icon: "stone-pile",
        subtitle: "คุณถูกเปลี่ยนเป็นหิน",
        description: "คุณถูกเปลี่ยน พร้อมกับวัตถุที่คุณสวมใส่หรือถือครอง เป็นสารที่ไม่มีชีวิต (มักเป็นหิน)",
        reference: "PHB, หน้า 291.",
        bullets: [
            "น้ำหนักของคุณเพิ่มขึ้นสิบเท่า และคุณหยุดอายุ",
            "คุณไร้ความสามารถ ไม่สามารถเคลื่อนไหวหรือพูดได้ และไม่รับรู้สิ่งรอบข้าง",
            "การทอยโจมตีต่อคุณได้เปรียบ",
            "คุณล้มเหลวในการทอยเซฟ Strength และ Dexterity โดยอัตโนมัติ",
            "คุณมีความต้านทานต่อความเสียหายทั้งหมด",
            "คุณภูมิต้านทานต่อพิษและโรค แต่พิษหรือโรคที่อยู่ในร่างกายจะถูกหยุดชั่วคราว"
        ]
    },
    {
        title: "ถูกพิษ",
        icon: "deathcab",
        subtitle: "คุณถูกพิษ",
        description: "คุณถูกพิษ",
        reference: "PHB, หน้า 292.",
        bullets: [
            "คุณเสียเปรียบในการทอยโจมตีและการตรวจสอบความสามารถ"
        ]
    },
    {
        title: "ล้มลง",
        icon: "crawl",
        subtitle: "คุณล้มลง",
        description: "คุณล้มลง",
        reference: "PHB, หน้า 292.",
        bullets: [
            "ตัวเลือกการเคลื่อนไหวเดียวของคุณคือคลาน ยกเว้นว่าคุณลุกขึ้นยืน",
            "คุณเสียเปรียบในการทอยโจมตี",
            "การทอยโจมตีต่อคุณได้เปรียบหากผู้โจมตีอยู่ภายในระยะ 5 ฟุต มิฉะนั้นการทอยโจมตีจะเสียเปรียบ"
        ]
    },
    {
        title: "ถูกควบคุม",
        icon: "imprisoned",
        subtitle: "คุณถูกควบคุม",
        description: "คุณถูกควบคุม",
        reference: "PHB, หน้า 292.",
        bullets: [
            "ความเร็วของคุณกลายเป็น 0 และคุณไม่สามารถได้รับประโยชน์จากโบนัสใดๆ ที่เพิ่มความเร็วได้",
            "คุณเสียเปรียบในการทอยโจมตี",
            "การโจมตีจะได้เปรียบต่อคุณ",
            "คุณเสียเปรียบในการทอยเซฟ Dexterity"
        ]
    },
    {
        title: "มึนงง",
        icon: "internal-injury",
        subtitle: "คุณมึนงง",
        description: "คุณมึนงง",
        reference: "PHB, หน้า 292.",
        bullets: [
            "คุณไร้ความสามารถ ไม่สามารถเคลื่อนไหว และพูดได้เพียงเล็กน้อย",
            "การทอยโจมตีต่อคุณได้เปรียบ",
            "คุณล้มเหลวในการทอยเซฟ Strength และ Dexterity โดยอัตโนมัติ"
        ]
    },
    {
        title: "หมดสติ",
        icon: "coma",
        subtitle: "คุณหมดสติ",
        description: "คุณหมดสติ",
        reference: "PHB, หน้า 292.",
        bullets: [
            "คุณไร้ความสามารถ ไม่สามารถเคลื่อนไหวหรือพูดได้ และไม่รับรู้สิ่งรอบข้าง",
            "คุณทิ้งทุกอย่างที่ถืออยู่และล้มลง",
            "การทอยโจมตีต่อคุณได้เปรียบ",
            "การโจมตีใดๆ ที่โดนคุณเป็นการโจมตีคริติคอลหากผู้โจมตีอยู่ภายในระยะ 5 ฟุต",
            "คุณล้มเหลวในการทอยเซฟ Strength และ Dexterity โดยอัตโนมัติ"
        ]
    },
    {
        title: "กำลังจะตาย",
        icon: "dead-head",
        subtitle: "คุณกำลังจะตาย",
        description: "คุณถูกลดจุดชีวิตเหลือ 0 และกำลังจะตาย",
        reference: "PHB, หน้า 197.",
        bullets: [
            "หากคุณถูกลดจุดชีวิตเหลือ 0 จากความเสียหายที่ไม่ทำให้คุณตาย คุณจะหมดสติและกำลังจะตาย",
            "หากคุณได้รับการรักษา คุณจะฟื้นสติทันทีและไม่กำลังจะตายอีกต่อไป",
            "เมื่อคุณกำลังจะตาย ในช่วงเริ่มต้นของแต่ละเทิร์น คุณต้องทำการทอยเซฟความตาย ทอย d20 และไม่เพิ่มตัวปรับใดๆ",
            "ผลทอย 10 ขึ้นไปคือสำเร็จ ต่ำกว่า 9 คือความล้มเหลว",
            "เมื่อคุณสำเร็จครั้งที่ 3 คุณจะคงที่",
            "เมื่อคุณล้มเหลวครั้งที่ 3 คุณจะตาย",
            "ทอยได้ 1 นับเป็นการล้มเหลวสองครั้ง",
            "ทอยได้ 20 ทำให้คุณฟื้น 1 จุดชีวิตทันที",
            "คุณสามารถถูกทำให้คงที่โดยเพื่อนที่ใช้การกระทำ Stabilize และสำเร็จการตรวจสอบ Wisdom (Medicine) DC 10",
            "เมื่อคงที่ คุณจะฟื้น 1 จุดชีวิตหลังจาก 1d4 ชั่วโมง"
        ]
    }
]
